# IsUnderground Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MassSurfaceData..::..IsUnderground Property
MassSurfaceData Class See Also
---
Indicates if the roof, floor, slab, or wall surface reference is underground.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool IsUnderground { get; set; }
```

Visual Basic
---
```text
Public Property IsUnderground As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsUnderground {
	bool get ();
	void set (bool value);
}
```

# See Also
MassSurfaceData Class
Autodesk.Revit.DB.Analysis Namespace